hackffm/ESP32S3_OLED_Eyes/lib/hackffm_badge_lib/hackffm_badge_lib.cpp
// hackffm_badge_lib.cpp (cmd+K + cmd+0 to collapse)
#include "hackffm_badge_lib.h"

#include <WiFi.h>
#include <esp_wifi.h>
#include <WiFiMulti.h>
#include <elapsedMillis.h>
#include <Wire.h>

#include <ArduinoOTA.h>
#include <ESPmDNS.h>
#include <HTTPClient.h>
#include <Update.h>

#include "LL_Lib.h"

HackFFMBadgeLib HackFFMBadge;
HackFFMBadgeLib& Badge = HackFFMBadge;

// Displays are selected in platformio.ini
//#define U8G2_DISPLAYTYPE U8G2_SSD1306_128X64_ADAFRUIT_F_HW_I2C  /* 0.96 inch */
//#define U8G2_DISPLAYTYPE U8G2_SSD1306_128X64_NONAME_F_HW_I2C  /* 0.96 inch */
//#define U8G2_DISPLAYTYPE U8G2_SH1106_128X64_NONAME_F_HW_I2C   /* 1.3 inch */
//#define U8G2_DISPLAYTYPE U8G2_SSD1309_128X64_NONAME0_F_HW_I2C /* 2.42 inch */
// 
U8G2_DISPLAYTYPE u8g2(U8G2_R0,  /* reset=*/ U8X8_PIN_NONE);
U8G2LOG u8g2log;
#define U8LOG_FONT u8g2_font_tom_thumb_4x6_tf
#define U8LOG_FONT_X  4
#define U8LOG_FONT_Y  6
#define U8LOG_WIDTH ((U8G2_DISP_WIDTH - 4) / U8LOG_FONT_X)
#define U8LOG_HEIGHT 6
uint8_t u8log_buffer[U8LOG_WIDTH*U8LOG_HEIGHT];

// Use these for Audio output
#define LEDC_CHANNEL_AUDIO 0
#define LEDC_RESOLUTION_AUDIO 8

#define FIRMWARE_URL "http://192.168.4.1/hackffmbadgev1_fw.bin"  // URL zur Firmware
#define VERSION_URL  "http://192.168.4.1/hackffmbadgev1_vers.txt"  // URL zur Versionsdatei

void HackFFMBadgeLib::begin() {
  // Conserve power (to allow CR123 battery operation)
  WiFi.mode(WIFI_OFF);
  delay(1);

  // Activate Serial but wait no longer than 1s to be ready
  Serial.begin(115200); // Baudrate does not matter as it is done via USB CDC...
  elapsedMillis serialUpTimeout = 0;
  while (!Serial && serialUpTimeout < 1000) {
    delay(1);
  }

  // Perform hardware detection
  detectHardware();

  // Initialize filesystem
  if(!LittleFS.begin()) {
    Serial.println("filesystem Mount Failed");
    return;
  }
  listDir("/", 0);

  // Start face
  if(face_) delete face_;
  face_ = new Face(/* screenWidth = */ 128, /* screenHeight = */ 64, /* eyeSize = */ 40);
  faceActive = true;

  delay(3000);
  Serial.println("HackFFM Badge initialized");
}

// Touch sensor update, ArduinoOTA and Face update
void HackFFMBadgeLib::update() {
  if(lastTouchRead > 100) {
    lastTouchRead = 0;
    for(int i = 0; i < NUM_TOUCH_PINS; i++) {
      touch[i].update();
    }
    lastTouchLU = (float)touch[0].getTouchValue() / 50.0;
    lastTouchLD = (float)touch[1].getTouchValue() / 50.0;
    lastTouchRU = (float)touch[2].getTouchValue() / 50.0;
    lastTouchRD = (float)touch[3].getTouchValue() / 50.0;
    lastTouchX = (-lastTouchLU) + (-lastTouchLD) + (lastTouchRU) + (lastTouchRD);
    lastTouchY = (-lastTouchLU) + (-lastTouchRU) + (lastTouchLD) + (lastTouchRD);
    touchUpdated = true;
  }

  // Update face without drawing
  if((faceActive) && (face_)) {
    face_->Update(true);
  }

  ArduinoOTA.handle();
  if(OTAinProgress == true) {
    for(int i=0; i<20; i++) {
      delay(10);
      ArduinoOTA.handle();
    }
  } 
    
}

void HackFFMBadgeLib::listDir(const char *dirname, uint8_t levels) {
  Serial.printf("Listing directory: %s\r\n", dirname);

  fs::File root = filesystem.open(dirname);
  if (!root) {
    Serial.println("- failed to open directory");
    return;
  }
  if (!root.isDirectory()) {
    Serial.println(" - not a directory");
    return;
  }

  fs::File file = root.openNextFile();
  while (file) {
    if (file.isDirectory()) {
      Serial.print("  DIR : ");
      Serial.println(file.name());
      if (levels) {
        listDir(file.path(), levels - 1);
      }
    } else {
      Serial.print("  FILE: ");
      Serial.print(file.name());
      Serial.print("\tSIZE: ");
      Serial.println(file.size());
    }
    file = root.openNextFile();
  }

  size_t t = LittleFS.totalBytes();
  size_t u = LittleFS.usedBytes();
  
  Serial.printf("Total space: %d, used space: %d, free space: %d\r\n", t, u, t - u);
}

// Function to write a string to a file
bool HackFFMBadgeLib::writeFile(const char *path, const String &data) {
  File file = filesystem.open(path, "w"); // "w" overwrite file
  if (!file) {
    LL_Log.println("Can't open file to write");
      return false;
  }
  file.print(data);
  file.close();
  LL_Log.println("File written");
  return true;
}

// Function to read a file and return the content as a string
String HackFFMBadgeLib::readFile(const char *path) {
  File file = filesystem.open(path, "r");  
  String data = "";
  if (!file) {
    LL_Log.println("Can't open file for reading");
      return data;
  }
  while (file.available()) {
      data += (char)file.read();
  }
  file.close();
  return data;
}

void HackFFMBadgeLib::writeTone(uint32_t freq /* 0 to stop */, uint32_t duty) {
  if(pinAudio < 0) return;
  #if defined(ESP_ARDUINO_VERSION_MAJOR) && ESP_ARDUINO_VERSION_MAJOR >= 3
    if(freq == 0) {
      ledcDetach(pinAudio);
    } else {
      ledcAttachChannel(pinAudio, freq, LEDC_RESOLUTION_AUDIO, LEDC_CHANNEL_AUDIO);
      ledcWrite(pinAudio, duty);
    }
  #else
    if(freq == 0) {
      ledcDetachPin(pinAudio);
    } else {
      ledcSetup(LEDC_CHANNEL_AUDIO, freq, LEDC_RESOLUTION_AUDIO);
      ledcAttachPin(pinAudio, LEDC_CHANNEL_AUDIO);
      ledcWrite(LEDC_CHANNEL_AUDIO, duty);
    }
  #endif
}

void HackFFMBadgeLib::drawLog(bool noDraw) {
  // Align Log-box from lower-left corner
  int logbox_y = u8g2.getDisplayHeight() - (U8LOG_HEIGHT * U8LOG_FONT_Y) - 3;
  u8g2.setFont(U8LOG_FONT);
  u8g2.setFontPosTop();
  u8g2.setFontMode(0);
  u8g2.setDrawColor(1);
  u8g2.drawBox(0,logbox_y,u8g2.getDisplayWidth(),u8g2.getDisplayHeight()-logbox_y);
  u8g2.setDrawColor(0);
  u8g2.drawBox(1,logbox_y+1,u8g2.getDisplayWidth()-2,u8g2.getDisplayHeight()-(logbox_y+2));
  u8g2.setDrawColor(1);
  u8g2.drawLog(2,logbox_y+1,u8g2log);
  if(!noDraw) u8g2.sendBuffer();  
  u8g2.setDrawColor(1);
}

// BMP-Header-Struktur
struct __attribute__((packed)) BMPHeader {
  uint16_t signature;
  uint32_t fileSize;
  uint32_t reserved;
  uint32_t dataOffset;
  uint32_t headerSize;
  int32_t width;
  int32_t height;
  uint16_t planes;
  uint16_t bitsPerPixel;
};

void HackFFMBadgeLib::drawBMP(const char *filename, bool noDraw) {
  File file = filesystem.open(filename, "r");
  if (!file) {
      Serial.println("Can't open file!");
      return;
  }

