hackffm/ESP32S3_OLED_Eyes/lib/hackffm_badge_lib/hackffm_badge_lib.cpp
  BMPHeader header;
  file.read((uint8_t *)&header, sizeof(BMPHeader));

  /*
  Serial.printf("Signature: %x\r\n", header.signature);
  Serial.printf("Filesize: %d\r\n", header.fileSize);   
  Serial.printf("DataOffset: %d\r\n", header.dataOffset);
  Serial.printf("HeaderSize: %d\r\n", header.headerSize);
  Serial.printf("Width: %d\r\n", header.width); 
  Serial.printf("Height: %d\r\n", header.height);
  Serial.printf("Planes: %d\r\n", header.planes);
  Serial.printf("BitsPerPixel: %d\r\n", header.bitsPerPixel);
  */

  if (header.signature != 0x4D42 || header.bitsPerPixel != 1) {
      Serial.println("BMP-Format not supported!");
      file.close();
      return;
  }

  int width = header.width;
  int height = abs(header.height);
  bool flip = (header.height > 0);
  int rowSize = ((width + 31) / 32) * 4;
  uint8_t rowBuffer[rowSize];

  //u8g2.clearBuffer(); 

  for (int y = 0; y < height; y++) {
      int rowIndex = flip ? (height - 1 - y) : y;
      file.seek(header.dataOffset + rowIndex * rowSize, SeekSet);
      file.read(rowBuffer, rowSize);

      for (int x = 0; x < width; x++) {
          int byteIndex = x / 8;
          int bitIndex = 7 - (x % 8);
          bool pixel = (rowBuffer[byteIndex] >> bitIndex) & 1;
          u8g2.setDrawColor(pixel ? 1 : 0);
          u8g2.drawPixel(x, y);
      }
  }
  file.close();

  if(!noDraw) u8g2.sendBuffer();  
  u8g2.setDrawColor(1);
}

/* Special characters:
 * 0x0a \n: new line
 * $: Escape, next char defines action
 *    $: prints $
 *    c,l,r: center/left/right aligned
 *    0..9,a,b,d,e,f,g: set fonts
 *    !: clear display
 */
void HackFFMBadgeLib::drawString(const char *str, int x, int y, int dy, bool noDraw) {
  if(!OledAddress) return;
  char buf[512];
  char c;
  int  idx = 0;
  int w = u8g2.getDisplayWidth();
  int sw = 0; // getUTF8Width(
  int dsFlags = 0;
  int newX = x;

   do {
    c = *str++;
    if(c>=' ') {
      if(dsFlags & 1) {
        dsFlags &= ~(1);
        switch(c) {
          case '$': buf[idx++] = c; break;
          case 'n': c = '\n'; goto LINEFEED; break;
          case '!': u8g2.clearBuffer(); break;
          case '+': y++; break;
          case '-': y--; break;
          case 'c':
            dsFlags &= ~(6);
            dsFlags |= 2;
            break;
          case 'l':
            dsFlags &= ~(6);
            break; 
          case 'r':
            dsFlags &= ~(6);
            dsFlags |= 4;
            break;
          // Fonts
          case '0': u8g2.setFont(u8g2_font_tinyunicode_tf); break; // 27  
          case '1': u8g2.setFont(u8g2_font_nokiafc22_tf); break; // 22.2  
          case '2': u8g2.setFont(u8g2_font_busdisplay11x5_te); break;   // 21.5
          case '3': u8g2.setFont(u8g2_font_sonicmania_te); break; // 19.1          nice bold
          case 'E': u8g2.setFont(u8g2_font_prospero_bold_nbp_tf); break; // ?          nice bold
          case '4': u8g2.setFont(u8g2_font_DigitalDiscoThin_tf); break; // 16.2
          case '5': u8g2.setFont(u8g2_font_scrum_tf); break; // 16 a
          case '6': u8g2.setFont(u8g2_font_DigitalDisco_tf); break; // 16 b        nice bold
          case 'G': u8g2.setFont(u8g2_font_profont17_tf); break; // 16 b        nice bold
          case '7': u8g2.setFont(u8g2_font_fur11_tf); break; // 16 c
          case '8': u8g2.setFont(u8g2_font_Pixellari_tf); break; // 15.5           nice bold
          case '9': u8g2.setFont(u8g2_font_fub11_tf); break; // 14.1
          case 'a': u8g2.setFont(u8g2_font_lucasarts_scumm_subtitle_o_tf); break; // 12
          case 'b': u8g2.setFont(u8g2_font_lucasarts_scumm_subtitle_r_tf); break; // 12          
          case 'd': u8g2.setFont(u8g2_font_fur14_tf); break; // 11.5
          case 'e': u8g2.setFont(u8g2_font_fub14_tf); break; // 11.5
          case 'f': u8g2.setFont(u8g2_font_chargen_92_tf); break; //10.9
          case 'g': u8g2.setFont(u8g2_font_inr21_mf); break; // ?
          case 's': u8g2.setFont(u8g2_font_sticker100complete_te); break; // ?
          case 'i': u8g2.setFont(u8g2_font_m2icon_9_tf); break;
                             
        }
      } else {
        if(c=='$') {
          dsFlags |= 1;
        } else {
          buf[idx++] = c;
        }        
      }
    } else {
      LINEFEED:
      switch(c) {
        case 0:
        case '\n':
          buf[idx] = 0;
          sw = u8g2.getUTF8Width(buf);
          if(dsFlags & 2) {
            // centered (plus offsetted by x)
            newX = (w - sw)/2 + x;
          } else if(dsFlags & 4) {
            // right (minus offsetted by x)
            newX = (w - sw) - x;
          } else {
            newX = x;
          }
          y += u8g2.getAscent()-u8g2.getDescent()+dy;
          u8g2.drawUTF8(newX,y,buf);
          idx = 0;
          break; 
      }
    }
  } while(c);

  if(!noDraw) u8g2.sendBuffer();

}

void HackFFMBadgeLib::initOLED() {
  // Unlike almost every other Arduino library (and the I2C address scanner script etc.)
  // u8g2 uses 8-bit I2C address, so we shift the 7-bit address left by one
  u8g2.setI2CAddress(OledAddress<<1);
  u8g2.begin();
  u8g2.enableUTF8Print();

  // make it faster
  u8g2.setBusClock(1000000UL);

  // dim display down 
  //u8g2.sendF("ca", 0xdb, 0); // not for SH1106 - need af (e3) afterwards
  //u8g2.sendF("ca", 0xd9, 0x2f);
  //u8g2.sendF("ca", 0xaf); // reactivate if display turns off (SH1106 need it)
  //u8g2.setContrast(0x32); // u8g2.sendF("ca", 0x81, 32);
  String BootMsg = "$!$c$6HackFFM Badge V1\n";
  BootMsg += String(__DATE__) + "\n" + String(__TIME__);

  drawString(BootMsg.c_str());

  u8g2log.begin(U8LOG_WIDTH, U8LOG_HEIGHT, u8log_buffer);	// assign only buffer, update full manual
  u8g2log.print("u8g2log:\r\n");
}

void HackFFMBadgeLib::detectHardware() {
  pinVariantIndex = 0; OledAddress = 0;
  if(freenoveBoardLED) { delete freenoveBoardLED; freenoveBoardLED = nullptr; }
  if(freenoveAntennaLED) { delete freenoveAntennaLED; freenoveAntennaLED = nullptr; }

  // Try to detect blue or black board by checking GPIO3
  pinMode(3, OUTPUT);
  digitalWrite(3, HIGH);
  delay(2);
  pinMode(3, INPUT_PULLUP);
  delay(2);
  int pina3 = analogRead(3);  // black: 2933, 2955  blue: 3685
  Serial.printf("GPIO3 ADC: %d\n", pina3);
  if((pina3 > 2700) && (pina3 < 3200)) {
    boardType = 2; // black
    freenoveBoardLED = new Freenove_ESP32_WS2812(1, 48, 0);
    freenoveBoardLED->begin();
  } else if(pina3 > 3200) {
    boardType = 1; // blue
    freenoveBoardLED = new Freenove_ESP32_WS2812(1, 21, 0);
    freenoveBoardLED->begin();
  } else {
    boardType = 0; // unknown
  }
  Serial.printf("BoardType: %s\n", boardTypeTexts[boardType]);

  setBoardLED(0, 1, 0); // green dark

  // Try find OLED display which defines board variant
  int ret = 0;  // 0: not found
  for(int i = 1; i < NUM_PIN_VARIANTS; i++) {
    TwoWire WireTemp = TwoWire(0);
    //WireTemp.endTransmission();
    WireTemp.begin(pinVariants[i][0], pinVariants[i][1], 100000);
    WireTemp.beginTransmission(0x3c);
    if(WireTemp.endTransmission() == 0) {
      WireTemp.end();
      OledAddress = 0x3c;
      ret = i;
      break;
    }
    WireTemp.beginTransmission(0x3d);
    if(WireTemp.endTransmission() == 0) {
      WireTemp.end();
      OledAddress = 0x3d;
      ret = i;
      break;
    }
    WireTemp.end();
  }

  // Set pins according to detected variant
  pinVariantIndex = ret;
  pinOledSda  = pinVariants[pinVariantIndex][0];
  pinOledSck  = pinVariants[pinVariantIndex][1];
  pinPwrHold  = pinVariants[pinVariantIndex][2];
  pinAudio    = pinVariants[pinVariantIndex][3];
  pinAudioEn  = pinVariants[pinVariantIndex][4];
  pinTouchLU  = pinVariants[pinVariantIndex][5];
  pinTouchLD  = pinVariants[pinVariantIndex][6];
  pinTouchRU  = pinVariants[pinVariantIndex][7];
  pinTouchRD  = pinVariants[pinVariantIndex][8];
  pinNeoPixel = pinVariants[pinVariantIndex][9];
  pinExtA     = pinVariants[pinVariantIndex][10];
  pinExtB     = pinVariants[pinVariantIndex][11];
  pinBoardRGB = pinVariants[pinVariantIndex][12];
  pinBoardTx  = pinVariants[pinVariantIndex][13];
  pinBoardRx  = pinVariants[pinVariantIndex][14];

  // Set pins
  pinMode(0, INPUT_PULLUP); // Button
  pinMode(pinBoardRx, INPUT_PULLUP);

  // Set power hold active
  setPowerHold(true);

  // Re-Init NeoPixel
  if(freenoveBoardLED) { delete freenoveBoardLED; freenoveBoardLED = nullptr; }
  if(freenoveAntennaLED) { delete freenoveAntennaLED; freenoveAntennaLED = nullptr; }
  if(pinBoardRGB >= 0) {
    freenoveBoardLED = new Freenove_ESP32_WS2812(1, pinBoardRGB, 0);
    freenoveBoardLED->begin();
  }
  if(pinNeoPixel >= 0) {
    freenoveAntennaLED = new Freenove_ESP32_WS2812(10, pinNeoPixel, 1, TYPE_GRB);
    freenoveAntennaLED->begin();
  }

  // Init OLED display if found or blink red-blue 5 times
  if(ret >= 1) {
    Wire.begin(pinOledSda, pinOledSck, 400000);
    initOLED();
    Serial.printf("OLED Display found at 0x%02x on SDA=%d, SCK=%d\n", OledAddress, pinOledSda, pinOledSck);
    switch(pinVariantIndex) {
      case 1: Serial.println("Badge PCB V2, blue  ESP32-S3-Zero"); break;
      case 2: Serial.println("Badge PCB V2, black ESP32-S3 Super Mini"); break;
      default: Serial.println("Unknown variant"); break;
    }
    setBoardLED(0, 1, 0); // green dark
    setAntennaLED(12, 4, 0); // orange
  } else {
    Serial.println("No OLED display found - detection of variant not possible, other hardware not available!");

