hackffm/ESP32S3_OLED_Eyes/lib/hackffm_badge_lib/hackffm_badge_lib.cpp
void HackFFMBadgeLib::setupOTA() {
  ArduinoOTA.onStart([]() {
    String type;
    if (ArduinoOTA.getCommand() == U_FLASH) {
      type = "sketch";
    } else {  // U_FS
      type = "filesystem";
    }
    // NOTE: if updating FS this would be the place to unmount FS using FS.end()
    LL_Log.println("Start updating " + type);
    Badge.OTAinProgress = true;
  });
  ArduinoOTA.onEnd([]() {
    LL_Log.println("\r\nOTA Done.");
    Badge.OTAinProgress = false;
  });
  ArduinoOTA.onProgress([](unsigned int progress, unsigned int total) {
    //Serial.printf("Progress: %u%%\r", (progress / (total / 100)));
  });
  ArduinoOTA.onError([](ota_error_t error) {
    LL_Log.printf("Error[%u]: ", error);
    if (error == OTA_AUTH_ERROR) {
      LL_Log.println("Auth Failed");
    } else if (error == OTA_BEGIN_ERROR) {
      LL_Log.println("Begin Failed");
    } else if (error == OTA_CONNECT_ERROR) {
      LL_Log.println("Connect Failed");
    } else if (error == OTA_RECEIVE_ERROR) {
      LL_Log.println("Receive Failed");
    } else if (error == OTA_END_ERROR) {
      LL_Log.println("End Failed");
    }
  });
  ArduinoOTA.begin();
  
  MDNS.begin(badgeHostname);
  MDNS.addService("debug", "tcp", 2222);
}

void HackFFMBadgeLib::tryToUpdate() {
  WiFi.disconnect();
  if (connectWifi("HACKFFM_BADGE_UPDATER", "")) {
    LL_Log.println("Connected to HACKFFM_BADGE_UPDATER");
    LL_Log.println("Starting OTA update...");
    HTTPClient http;
    http.begin(VERSION_URL);
    int httpCode = http.GET();
    if (httpCode == HTTP_CODE_OK) {
        String version = http.getString();
        LL_Log.println("Firmware version on server: " + version);
    }
    http.end();
    http.begin(FIRMWARE_URL);
    httpCode = http.GET();
    if (httpCode == HTTP_CODE_OK) {
        int contentLength = http.getSize();
        if (contentLength > 0) {
            WiFiClient * stream = http.getStreamPtr();
            if (Update.begin(contentLength)) {
                size_t written = Update.writeStream(*stream);
                if (written == contentLength && Update.end()) {
                    ESP.restart();
                }
            }
        }
    }
    http.end();
    LL_Log.println("OTA update finished.");
  } else {
    LL_Log.println("Failed to connect to HACKFFM_BADGE_UPDATER");
  }
  WiFi.disconnect();
  WiFi.mode(WIFI_OFF);
}

float mapFloat(float x, float in_min, float in_max, float out_min, float out_max) {
  // Check if x is outside the input range
  if (x <= in_min) return out_min;
  if (x >= in_max) return out_max;

  // Calculate the proportion of x relative to the input range
  float proportion = (x - in_min) / (in_max - in_min);

  // Map the proportion to the output range and return the result
  return (proportion * (out_max - out_min)) + out_min;
}
